[
  {
    "topic": "World",
    "title": "If Harry thought his China stunt would overshadow the King’s Canada trip he was sorely mistaken, expert says",
    "url": "https://www.thesun.co.uk/royals/35171697/prince-harry-china-king-charles-canada/",
    "published_at": "2025-05-29T16:27:23",
    "summary": "## If Harry thought his China stunt would overshadow the King’s Canada trip he was sorely mistaken, expert says\n\n• Harry's visit to China drew attention due to its proximity to the King's Canada trip.\n• Royal expert Bronte Coy claims that Charles' speech was miles above what Harry could have achieved in his time in China.\n• Harry's appearance didn't make the cut, with the King's impactful speech overshadowing his performance."
  },
  {
    "topic": "Politics",
    "title": "Vincent Bevins: ‘The elites have discovered they can govern us without legitimacy’",
    "url": "https://english.elpais.com/culture/2025-05-31/vincent-bevins-the-elites-have-discovered-they-can-govern-us-without-legitimacy.html",
    "published_at": "2025-05-31T04:00:00",
    "summary": "Sure, here is the summary you requested:\n\n**Title:** Vincent Bevins: ‘The elites have discovered they can govern us without legitimacy’\n\n**Summary:** Vincent Bevins, an international reporter who witnessed the Brazilian protests in 2013, argues that the resistance of the 2010s was fundamentally reactive, with the elites discovering they could govern without legitimacy."
  },
  {
    "topic": "Business",
    "title": "Active Funds See Surging Inflows But Can They Beat the Market?",
    "url": "https://www.investopedia.com/wall-street-and-active-funds-11741834",
    "published_at": "2025-05-30T20:11:31",
    "summary": "## Active Funds See Outsized Inflows But Can They Beat the Market?\n\n**30% of ETF money recently poured into actively managed ETFs, highlighting a potential comeback for this traditionally criticized segment.**"
  },
  {
    "topic": "Technology",
    "title": "Behind Slim: How Samsung Engineered the Galaxy S25 Edge To Break Boundaries",
    "url": "https://news.samsung.com/global/behind-slim-how-samsung-engineered-the-galaxy-s25-edge-to-break-boundaries?utm_source=rss&utm_medium=direct",
    "published_at": "2025-05-30T17:00:02",
    "summary": "## Galaxy S25 Edge: A Tiny Phone, A Powerful Presence\n\nThe Galaxy S25 Edge is a premium smartphone that breaks boundaries by achieving the slimmest profile in the Galaxy S series history. It boasts a robust design crafted from premium materials and a titanium frame, making it both durable and stylish.\n\nThe phone's camera system is another highlight, featuring a 200MP main sensor that delivers exceptional clarity and detail, even in low-light conditions. This smartphone is a testament to Samsung's commitment to creating devices that are both functional and aesthetically pleasing."
  },
  {
    "topic": "Entertainment",
    "title": "Terrence Howard Film ‘Cipher’ Crew Goes on Strike in Push for IATSE Contract",
    "url": "https://www.thewrap.com/terrence-howard-film-cipher-crew-goes-on-strike-in-push-for-iatse-contract/",
    "published_at": "2025-05-29T22:48:28",
    "summary": "## Cipher Crew Goes on Strike\n\nA team working on Terrence Howard's independent film \"Cipher\" has gone on strike due to a lack of a union contract. The crew members, primarily non-union workers, signed authorization cards signaling their intent to collectively bargain and are demanding health plan and pension benefits. The union gave the production company until Wednesday to respond but did not hear back, leading them to stage a \"recognition strike.\""
  },
  {
    "topic": "Sports",
    "title": "Yainer Diaz’s walkoff home run backs Framber Valez’s three-hitter as Astros beat Rays 2-1",
    "url": "https://www.fox13news.com/sports/yainer-diazs-walkoff-home-run-backs-framber-valezs-three-hitter-astros-beat-rays-2-1",
    "published_at": "2025-05-31T03:02:27",
    "summary": "## Astros Clinish Series Opener with Walkoff Home Run\n\nThe Astros edged the Rays 2-1 on Friday night, with Yainer Diaz's dramatic walkoff home run proving to be the game-changer. Despite trailing 1-0 in the ninth, the Astros staged a thrilling comeback thanks to the power of their bats and the brilliance of Framber Valdez."
  },
  {
    "topic": "Health",
    "title": "Renpho Elis Solar 2 Smart Body Scale review: These solar-powered scales are my go-to health tracker",
    "url": "https://www.telegraph.co.uk/recommended/leisure/fitness/renpho-elis-solar-2-smart-body-scale-review/",
    "published_at": "2025-05-30T13:53:09",
    "summary": "## Renpho Elis Solar 2 Smart Body Scale review: These solar-powered scales are my go-to health tracker\n\n• The Renpho Elis Solar 2 offers broad health monitoring with 13 body metrics, including weight, BMI and muscle mass, thanks to its eco-friendly solar charging.\n\n• These smart scales are easy to set up and connect via Bluetooth to the brand's Health app.\n\n• The focus on accuracy ensures consistent and reliable readings, with results matching other tests.\n\n• The minimalist design fits easily into most bathrooms and supports unlimited user profiles."
  },
  {
    "topic": "Environment",
    "title": "There’s nothing left of the man that was Harry, he’s erratic and just watching Meghan crack on, expert says",
    "url": "https://www.thesun.co.uk/royals/35170792/prince-harry-meghan-markle-nothing-left-erratic/",
    "published_at": "2025-05-31T14:15:20",
    "summary": "**Headline:** Prince Harry's Existence Shrinks as He Watches Meghan Markle Rise\n\n**Summary:**\nThe article explores Prince Harry's diminishing presence in the royal spotlight, with his focus now solely on Meghan Markle's success. Despite his charitable endeavors, Harry feels his former self has been extinguished, leaving him with nothing but an erratic existence centered around his wife's career. This visit to China comes amidst an erratic year for Harry, marked by court cases and a lack of clear direction in his royal pursuits."
  },
  {
    "topic": "Science",
    "title": "China’s Tianwen-2 Launches to Retrieve Samples from Mysterious Asteroid Kamo’oalewa",
    "url": "https://thedebrief.org/chinas-tianwen-2-launches-to-retrieve-samples-from-mysterious-asteroid-kamooalewa/",
    "published_at": "2025-05-30T11:55:31",
    "summary": "## Tianwen-2 Mission: Exploring a Mysterious Asteroid\n\n**China's Tianwen-2 spacecraft successfully launched on May 28, embarking on a ten-year journey to retrieve samples from the mysterious asteroid Kamo'oalewa.**\n\nThe mission will explore the unusual quasi-satellite, seeking answers about its origins and composition. Scientists aim to determine if Kamo'oalewa is a fragment of the Moon or a distant asteroid belt wanderer.\n\n**Key points:**\n\n* Tianwen-2 is China's first asteroid sample return mission.\n* The mission will study the asteroid's composition and search for signs of water or organic material.\n* Following the sample phase, Tianwen-2 will return to Earth for a second study of Comet 311P."
  },
  {
    "topic": "Education",
    "title": "What’s on your mind?",
    "url": "https://forums.macrumors.com/threads/whats-on-your-mind.2135938/",
    "published_at": "2025-05-31T15:15:22",
    "summary": "## Calculus at my university is difficult but procrastinating is easy.\n\nThe author reflects on their struggle with calculus in college, highlighting the disconnect between high school and higher education mathematics. Despite initial challenges, they acknowledge that the subject holds some personal interest."
  }
]