[
  {
    "topic": "World",
    "title": "If Harry thought his China stunt would overshadow the King’s Canada trip he was sorely mistaken, expert says",
    "url": "https://www.thesun.co.uk/royals/35171697/prince-harry-china-king-charles-canada/",
    "published_at": "2025-05-29T16:27:23",
    "summary": "## World: Prince Harry's China stunt fails to overshadow King Charles' Canada visit\n\nThe Duke of Sussex's recent solo appearance in China failed to steal the limelight from the King's visit to Canada, a royal expert has stated. Charles' impactful speech and the strong presence of both leaders during his address to Parliament left Harry's performance feeling overshadowed."
  },
  {
    "topic": "Politics",
    "title": "Vincent Bevins: ‘The elites have discovered they can govern us without legitimacy’",
    "url": "https://english.elpais.com/culture/2025-05-31/vincent-bevins-the-elites-have-discovered-they-can-govern-us-without-legitimacy.html",
    "published_at": "2025-05-31T04:00:00",
    "summary": "Vincent Bevins: ‘The elites have discovered they can govern us without legitimacy’\n- [ERROR: Could not summarize with Gemma 2B after 3 attempts]"
  },
  {
    "topic": "Business",
    "title": "Active Funds See Surging Inflows But Can They Beat the Market?",
    "url": "https://www.investopedia.com/wall-street-and-active-funds-11741834",
    "published_at": "2025-05-30T20:11:31",
    "summary": "**Active Funds See Outsized Inflows But Can They Beat the Market?**\n\nActive funds are seeing a resurgence in popularity, with 30% of ETF money flowing into actively managed ETFs so far in 2025. This trend suggests that investors are seeking the potential for higher returns that active managers offer. However, active funds come with high fees and can be difficult to beat in the long run."
  },
  {
    "topic": "Technology",
    "title": "Behind Slim: How Samsung Engineered the Galaxy S25 Edge To Break Boundaries",
    "url": "https://news.samsung.com/global/behind-slim-how-samsung-engineered-the-galaxy-s25-edge-to-break-boundaries?utm_source=rss&utm_medium=direct",
    "published_at": "2025-05-30T17:00:02",
    "summary": "## Behind Slim: How Samsung Engineered the Galaxy S25 Edge To Break Boundaries\n\n**Tech Review:** The Galaxy S25 Edge is a powerful pocket-sized AI companion that pushes the boundaries of what a mobile device can be. With its sleek design and innovative engineering, the S25 Edge delivers a premium experience without being bulky.\n\n**Design & Engineering:** The device is meticulously engineered for design, performance and camera excellence. The Galaxy S25 Edge features a new mounting system, a robust titanium frame, and Corning Gorilla Glass Ceramic 2 for increased durability.\n\n**Performance & Camera:** The phone delivers the same power and speed found across the Galaxy S25 series thanks to the Snapdragon® 8 Elite Mobile Platform for Galaxy1. The dual camera system with a 200MP main sensor captures stunning photos and videos with exceptional clarity and detail.\n\n**Conclusion:** The Galaxy S25 Edge is a breakthrough in mobile engineering that embodies Samsung's dedication to pushing the boundaries of design and innovation."
  },
  {
    "topic": "Entertainment",
    "title": "Terrence Howard Film ‘Cipher’ Crew Goes on Strike in Push for IATSE Contract",
    "url": "https://www.thewrap.com/terrence-howard-film-cipher-crew-goes-on-strike-in-push-for-iatse-contract/",
    "published_at": "2025-05-29T22:48:28",
    "summary": "# Cipher Strike: Production Goes On Strike\n\nA small independent film crew in Kentucky has gone on strike due to an attempt to organize for a union contract under the IATSE union. The crew, working on the low-budget movie \"Cipher,\" began shooting on May 12 and are currently filming under a Directors Guild of America and SAG-AFTRA contract. They are seeking health plan and pension benefits as the primary reason for their desire to collectively bargain. The union gave the production company until Wednesday to respond but did not hear back, leading to the crew members staging a \"recognition strike.\""
  },
  {
    "topic": "Sports",
    "title": "Yainer Diaz’s walkoff home run backs Framber Valez’s three-hitter as Astros beat Rays 2-1",
    "url": "https://www.fox13news.com/sports/yainer-diazs-walkoff-home-run-backs-framber-valezs-three-hitter-astros-beat-rays-2-1",
    "published_at": "2025-05-31T03:02:27",
    "summary": "# Astros vs. Rays\n\nIn a thrilling game, the Astros secured a 2-1 victory over the Rays. Yainer Diaz hit a walk-off home run in the ninth inning to give Houston the win. Framber Valdez pitched a three-hitter, striking out nine batters and giving up only two hits. Despite trailing 1-0 earlier in the game, the Astros staged a dramatic comeback with timely hits and a crucial walk-off home run."
  },
  {
    "topic": "Health",
    "title": "Renpho Elis Solar 2 Smart Body Scale review: These solar-powered scales are my go-to health tracker",
    "url": "https://www.telegraph.co.uk/recommended/leisure/fitness/renpho-elis-solar-2-smart-body-scale-review/",
    "published_at": "2025-05-30T13:53:09",
    "summary": "## Renpho Elis Solar 2 Smart Body Scale review: These solar-powered scales are my go-to health tracker\n\n**Summary:**\nThe Renpho Elis Solar 2 is a budget-friendly smart scale that offers a comprehensive suite of health and fitness features. It boasts solar charging for convenient power-up and uses a minimalist design for easy installation and use. The 13-metric tracking includes weight, BMI, muscle mass, and body water percentage, offering valuable insights into your overall health and fitness levels. \n\n**Key features:**\n\n* Solar-powered for convenient charging\n* 13 body metrics tracked: weight, BMI, muscle mass, body fat, body water, and more\n* Baby and pet mode for easy weighing\n* Athlete mode for accurate readings for athletes\n* Calorie sensor tracks daily calorie burn\n* External app and fitness tracker compatibility\n\n**Overall:**\nThe Renpho Elis Solar 2 is a well-equipped and user-friendly smart scale that provides a holistic picture of your health. Its unique solar charging feature and comprehensive tracking capabilities make it an attractive option for fitness enthusiasts and health-conscious individuals alike."
  },
  {
    "topic": "Environment",
    "title": "There’s nothing left of the man that was Harry, he’s erratic and just watching Meghan crack on, expert says",
    "url": "https://www.thesun.co.uk/royals/35170792/prince-harry-meghan-markle-nothing-left-erratic/",
    "published_at": "2025-05-31T14:15:20",
    "summary": "# World\n\nPrince Harry's recent visit to China appears to have been a mere formality, with a focus on promoting sustainable travel initiatives. His appearance clashed with the visit of King Charles and Queen Camilla to Canada, suggesting an erratic year for the Duke."
  },
  {
    "topic": "Science",
    "title": "China’s Tianwen-2 Launches to Retrieve Samples from Mysterious Asteroid Kamo’oalewa",
    "url": "https://thedebrief.org/chinas-tianwen-2-launches-to-retrieve-samples-from-mysterious-asteroid-kamooalewa/",
    "published_at": "2025-05-30T11:55:31",
    "summary": "## China's Tianwen-2 Mission to Return Samples from Mysterious Asteroid Kamo'oalewa\n\n**Overview:**\n- China's Tianwen-2 spacecraft successfully launched on May 28, aiming to retrieve samples from the enigmatic asteroid Kamo'oalewa.\n- It will spend ten years exploring this asteroid, searching for clues about its origin and formation.\n\n**Key Points:**\n\n* Kamo'oalewa is a unique quasi-satellite that follows an oscillating orbit around Earth.\n* China's mission is the first of its kind, following the successful sample returns from the Moon and near-Earth asteroid Itokawa.\n* The asteroid is expected to reveal insights into its origin, composition, and evolution.\n* The mission will also investigate the phenomenon of active asteroids, a class of objects that resemble comets but reside in the asteroid belt."
  },
  {
    "topic": "Education",
    "title": "What’s on your mind?",
    "url": "https://forums.macrumors.com/threads/whats-on-your-mind.2135938/",
    "published_at": "2025-05-31T15:15:22",
    "summary": "What’s on your mind?\n- [ERROR: Could not summarize with Gemma 2B after 3 attempts]"
  }
]