[
  {
    "topic": "General",
    "title": "General Motors (GM) earnings Q3 2025",
    "url": "https://www.cnbc.com/2025/10/21/general-motors-gm-earnings-q3-2025.html",
    "published_at": "2025-10-21T04:01:01Z",
    "summary": "Headline: General Motors Announces Strong Q3 2025 Earnings, Driven by Vehicle Demand\n\nSummary: General Motors is projecting strong third-quarter 2025 earnings, exceeding initial estimates due to robust vehicle demand across its brands. The company anticipates a net income of $4.5 billion, significantly higher than the $3.8 billion predicted previously.  GM’s increased profitability reflects strong sales of its electric vehicles and SUVs.  The company’s stock price reacted positively to the news, with investors expressing optimism about its future growth strategy."
  },
  {
    "topic": "World",
    "title": "Sanae Takaichi makes history as Japan’s first female prime minister",
    "url": "https://www.japantimes.co.jp/news/2025/10/21/japan/politics/sanae-takaichi-elected-japan-prime-minister/",
    "published_at": "2025-10-21T04:41:15Z",
    "summary": "Headline: Sanae Takaichi Elected Japan’s First Female Prime Minister, Marking Historic Shift\n\nSummary: Sanae Takaichi secured victory in Japan’s parliamentary election, becoming the nation’s inaugural female prime minister. The Liberal Democratic Party (LDP) leader achieved this milestone in the initial round of voting, successfully preventing a runoff. Takaichi’s election signifies a significant change within Japanese politics, previously dominated by men. This historic moment has been met with considerable attention both domestically and internationally."
  },
  {
    "topic": "US",
    "title": "Ukraine’s allies rush to bolster Zelenskyy amid fears over Trump-Putin deal",
    "url": "https://www.politico.eu/article/ukraine-russia-war-donald-trump-deal-economy-sanctions/",
    "published_at": "2025-10-21T03:00:00Z",
    "summary": "Headline: Allies Bolster Ukraine as Trump-Putin Talks Raise Ceasefire Fears\n\nSummary: European and international partners are intensifying efforts to strengthen Ukraine’s defensive capabilities in anticipation of upcoming discussions between Donald Trump and Vladimir Putin. Concerns have arisen that a potential agreement brokered by the two leaders could result in a fragile ceasefire agreement that would negatively impact European economies and potentially diminish existing sanctions against Russia. Diplomatic activity is focused on bolstering Ukraine’s military position and preparing for a range of possible outcomes from the summit. The situation underscores anxieties about the potential ramifications of a negotiated settlement on the ongoing conflict."
  },
  {
    "topic": "Business",
    "title": "What Are the 2 Top Artificial Intelligence (AI) Stocks to Buy Right Now?",
    "url": "https://www.fool.com/investing/2025/10/20/what-are-the-2-top-artificial-intelligence-ai-stoc/",
    "published_at": "2025-10-20T20:00:00Z",
    "summary": "Headline: Top AI Stocks Identified: Analysts Highlight Two Promising Investment Opportunities\n\nSummary: According to a recent analysis, the artificial intelligence market is projected to experience significant growth, with estimates suggesting a potential $4.8 trillion valuation by 2033. The United Nations Conference on Trade and Development anticipates this expansion will contribute trillions to the global economy over the coming decades.  The article specifically identifies two companies as particularly promising investments within the burgeoning AI sector. These firms are currently experiencing increased interest and are considered leaders in developing and deploying AI technologies."
  },
  {
    "topic": "Technology",
    "title": "Games Leaving PS Plus in November 2025 Confirmed",
    "url": "https://www.playstationlifestyle.net/2025/10/20/games-leaving-ps-plus-extra-premium-november-2025/",
    "published_at": "2025-10-21T01:51:17Z",
    "summary": "Headline: PlayStation Announces November 2025 Games Departing PS Plus Extra & Premium\n\nSummary: Sony has confirmed a list of games set to leave the PS Plus Extra and Premium subscription services in November 2025. The initial lineup includes Battlefield V and Like a Dragon: Ishin, which were previously anticipated to be removed. This release follows the commencement of the October lineup rollout across various regions, starting on Tuesday, October 21st. Subscribers will have until the removal date to download and play these titles."
  },
  {
    "topic": "Entertainment",
    "title": "Adam Driver Says Disney Shot Down Ben Solo 'Star Wars' Sequel Film Despite Lucasfilm Saying \"They Loved The Idea\"",
    "url": "https://deadline.com/2025/10/adam-driver-disney-shot-down-ben-solo-star-wars-spinoff-1236592654/",
    "published_at": "2025-10-20T22:37:00Z",
    "summary": "Headline: Adam Driver’s Ben Solo ‘Star Wars’ Spinoff Idea Rejected by Disney Despite Lucasfilm’s Support\n\nSummary: Adam Driver previously portrayed Ben Solo in the Star Wars sequel trilogy and subsequently proposed a direct sequel to *The Rise of Skywalker* as a standalone spinoff film. Despite Lucasfilm reportedly “loving the idea,” Disney ultimately rejected Driver’s pitch for the project. The proposed film would have explored Ben Solo’s backstory further following his fall to the dark side. Lucasfilm has not released a formal statement explaining the reasons behind the decision."
  },
  {
    "topic": "Sports",
    "title": "Fantasy football waiver wire Week 8: Kyle Monangai, Christian Watson, streamers",
    "url": "https://www.nytimes.com/athletic/6734933/2025/10/21/fantasy-football-waiver-wire-week-8-kyle-monangai-christian-watson-streamers/",
    "published_at": "2025-10-21T04:09:45Z",
    "summary": "Headline: Waiver Wire Week 8: Analysts Recommend Monangai, Watson, and Streamer Targets\n\nSummary: This week’s fantasy football waiver wire advice focuses on several players available to add to rosters. Kyle Monangai is highlighted as a promising tight end option due to increased opportunities within his team. Christian Watson is also identified as a streamer target, driven by a recent uptick in targets and potential for increased usage. Analysts suggest exploring streamers in various positions, capitalizing on injuries and changing team dynamics to boost fantasy performance."
  },
  {
    "topic": "Science",
    "title": "What Would Sean Duffy Do With NASA?",
    "url": "https://nasawatch.com/trumpspace/what-would-sean-duffy-do-with-nasa/",
    "published_at": "2025-10-21T01:17:14Z",
    "summary": "Headline: Trump’s Former Advisor Advocates for Major Shift in NASA’s Operational Control\n\nSummary: Former presidential commentator Sean Duffy recently suggested transferring NASA’s operations under the Department of Transportation. This proposal, reportedly discussed with government officials over the summer, stemmed from Duffy’s belief that NASA’s current structure was inefficient. The suggestion reflects a broader debate regarding the agency's priorities and potential integration within the broader federal government.  The idea highlights a strategic disagreement regarding NASA’s future direction and influence."
  },
  {
    "topic": "Health",
    "title": "After success in Idaho, anti-vaccine activists want to export their idiocy nationwide",
    "url": "https://arstechnica.com/health/2025/10/after-success-in-idaho-anti-vaccine-activists-want-to-export-their-idiocy-nationwide/",
    "published_at": "2025-10-20T13:51:44Z",
    "summary": "Headline: Anti-Vaccine Activists Expand Nationwide Efforts Following Idaho Success\n\nSummary: Following a successful campaign in Idaho, a group of anti-vaccine activists are seeking to replicate their tactics across the United States. The activists, documented in a video shared on social media, achieved a significant outcome by disrupting a public vaccination event.  The group’s actions involved creating a chaotic scene and presenting themselves as individuals seeking to prevent vaccination. ProPublica reports that the activists’ strategy appears to be centered on generating public attention and challenging vaccine mandates through disruptive demonstrations."
  }
]