[
  {
    "topic": "General",
    "title": "Marine Corps shrapnel hit patrol car on California's I-5 freeway during demonstration: CHP",
    "url": "https://abcnews.go.com/US/marine-corps-shrapnel-hit-patrol-car-californias-5/story?id=126670403",
    "published_at": "2025-10-20T03:45:00Z",
    "summary": "Headline: Marine Corps Shrapnel Damages Patrol Car on I-5\nSummary: Shrapnel from U.S. Marine Corps artillery rounds fired during a demonstration on California’s I-5 freeway struck a patrol car. The California Highway Patrol confirmed the incident occurred while Vice President JD Vance and Secretary of War Pete Hegseth were present."
  },
  {
    "topic": "World",
    "title": "Hong Kong: Two dead after cargo plane skids off runway into sea",
    "url": "https://www.bbc.com/news/live/c5y0e4e5ddxt",
    "published_at": "2025-10-20T03:48:06Z",
    "summary": "Headline: Cargo Plane Crashes Off Runway in Hong Kong, Killing Two\nSummary: A cargo plane crashed into the sea off the coast of Hong Kong following a runway excursion. Two individuals died in the incident, and authorities have affirmed that the airport provided correct instructions to the aircraft prior to the crash. An investigation into the cause of the accident is currently ongoing."
  },
  {
    "topic": "Nation",
    "title": "Marine Corps shrapnel hit patrol car on California's I-5 freeway during demonstration: CHP",
    "url": "https://abcnews.go.com/US/marine-corps-shrapnel-hit-patrol-car-californias-5/story?id=126670403",
    "published_at": "2025-10-20T03:45:00Z",
    "summary": "Headline: Marine Corps Shrapnel Strikes California Freeway Patrol Car\nSummary: Shrapnel from U.S. Marine Corps artillery rounds, fired during a demonstration involving Vice President Vance and Secretary Hegseth, struck a California Highway Patrol patrol car on Interstate 5. The incident resulted in damage to the vehicle."
  },
  {
    "topic": "Business",
    "title": "Should You Sell Nvidia Stock and Buy This Supercharged Quantum Computing Stock?",
    "url": "https://www.fool.com/investing/2025/10/20/should-you-sell-nvidia-stock-and-buy-this-supercha/",
    "published_at": "2025-10-20T04:00:00Z",
    "summary": "Headline: Nvidia Stock Performance Analyzed; Alternative Investment Suggested\nSummary: The article examines Nvidia’s significant stock performance, driven by its dominance in the artificial intelligence sector, which has yielded substantial returns for investors since 2023. It proposes an alternative investment in a quantum computing stock as a potential strategy for investors seeking to diversify their portfolios."
  },
  {
    "topic": "Technology",
    "title": "Nintendo Today 2.0.10 update out now, patch notes",
    "url": "https://nintendoeverything.com/nintendo-today-2-0-10-update-out-now-patch-notes/",
    "published_at": "2025-10-20T02:28:43Z",
    "summary": "Headline: Nintendo Today App Receives 2.0.10 Update\nSummary: The Nintendo Today mobile application has been updated to version 2.0.10. This update introduces improved functionality for sharing news content within the app."
  },
  {
    "topic": "Entertainment",
    "title": "Redemption, Forgiveness, and the Deeper Meaning of ‘Task’",
    "url": "https://www.theringer.com/2025/10/19/tv/task-finale-recap-tom-robbie-grasso",
    "published_at": "2025-10-20T02:01:00Z",
    "summary": "Headline: ‘Task’ Finale Offers Stark Character Study, Minimal Plot Resolution\nSummary: The final episode of “Task,” starring Tom Robbie and Grasso, concluded with a focus on the characters’ strained relationships and unresolved trauma. The episode primarily explored the psychological fallout of the series’ central mystery, detailing the characters’ emotional states and lingering regrets rather than providing definitive answers or a clear resolution to the overarching plot."
  },
  {
    "topic": "Sports",
    "title": "Doug Martin, former Buccaneers and Boise State RB, dies at 36 while reportedly in police custody",
    "url": "https://sports.yahoo.com/nfl/breaking-news/article/doug-martin-former-buccaneers-and-boise-state-rb-dies-at-36-while-reportedly-in-police-custody-205904588.html",
    "published_at": "2025-10-20T03:38:25Z",
    "summary": "Headline: Former Buccaneers RB Doug Martin Dies at 36\n\nSummary: Doug Martin, a former running back for the Tampa Bay Buccaneers and previously Boise State, died on Saturday at the age of 36. Authorities were reportedly involved with Martin at the time of his death."
  },
  {
    "topic": "Science",
    "title": "Is NASA A \"Democrat Agency\", Sean Duffy?",
    "url": "https://nasawatch.com/uncategorized/is-nasa-a-democrat-agency-sean-duffy/",
    "published_at": "2025-10-19T22:31:59Z",
    "summary": "Headline: NASA Administrator’s Political Comments Raised Concerns\nSummary: Recent comments made by NASA Administrator Sean Duffy regarding political affiliations have prompted criticism. Concerns have been voiced about potential political influence on NASA policy, echoing previous complaints about political involvement within the agency’s operations."
  },
  {
    "topic": "Health",
    "title": "My Son Was 1 Day Old When I Learned Our Family Had Been Exposed To Measles. Here's What Happened Next.",
    "url": "https://uk.news.yahoo.com/son-1-day-old-learned-023106819.html",
    "published_at": "2025-10-20T02:31:00Z",
    "summary": "Headline: Family Exposed to Measles Shortly After Newborn’s Birth\n\nSummary: A family learned their 16-month-old son may have been exposed to measles shortly after his birth during a hospital stay. The incident occurred when the mother received a notification regarding a potential measles exposure while her newborn was in a hospital bassinet."
  }
]